<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"94e8acd6caa75f9cc9b60b279d48c6449f6fec6023d5e2ab45bc1b25077edc0c","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1626 at https://github.com/cal-itp/data-infra/actions/runs/23028157267","plan_out_hash":"442d18f4a5fd3ab759164739fd335093daeaa7a34edf0abafcac46cf8b16ba42","plan_hash":"5fa35c62094e418b91f527a1e6eb9bb5429d61a438ac3a3f340c7e747d15e333","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 1 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "YA/0Cw==" -> (known after apply)
!~      detect_md5hash      = "cW7o4gxeMBkL9IQfpCRBNw==" -> "different hash"
!~      generation          = 1773238444726938 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "cW7o4gxeMBkL9IQfpCRBNw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/gtfs/int_gtfs_rt__vehicle_positions_trip_day_map_grouping.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "YJIG0Q==" -> (known after apply)
!~      detect_md5hash      = "1U7PFBtfVqjO+CcA1TJk1Q==" -> "different hash"
!~      generation          = 1751416663941403 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/intermediate/gtfs/int_gtfs_rt__vehicle_positions_trip_day_map_grouping.sql"
!~      md5hash             = "1U7PFBtfVqjO+CcA1TJk1Q==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs/int_gtfs_rt__vehicle_positions_trip_day_map_grouping.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/gtfs/int_gtfs_rt__vehicle_positions_trip_day_map_grouping_orig.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-composer-dags" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/intermediate/gtfs/int_gtfs_rt__vehicle_positions_trip_day_map_grouping_orig.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/intermediate/gtfs/int_gtfs_rt__vehicle_positions_trip_day_map_grouping_orig.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/_mart_gtfs_fcts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "a8CG8A==" -> (known after apply)
!~      detect_md5hash      = "MtqCkueHOGN1gosCleh35A==" -> "different hash"
!~      generation          = 1768514560618208 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs/_mart_gtfs_fcts.yml"
!~      md5hash             = "MtqCkueHOGN1gosCleh35A==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/_mart_gtfs_fcts.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "1GG6dw==" -> (known after apply)
!~      detect_md5hash      = "ajsb+B/xVxdEVDIMYx+N6A==" -> "different hash"
!~      generation          = 1773238446197328 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "ajsb+B/xVxdEVDIMYx+N6A==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1626](https://github.com/cal-itp/data-infra/actions/runs/23028157267)